#+OPTIONS: tags:nil
#+EXCLUDE_TAGS: startup codeblocks badresults hide

* Startup :startup:
#+begin_src elisp :exports none
(org-babel-do-load-languages 
 'org-babel-load-languages
 '((python t)))
(require 'ob-ipython)
(setq org-src-fontify-natively t)
(setq org-confirm-babel-evaluate nil)   ;don't prompt me to confirm everytime I want to evaluate a block
(setq ob-ipython-command "ipython-2.7")
(setq org-latex-default-figure-position "!tb")
(setq org-latex-default-table-position "!tb")
;;; display/update images in the buffer after I evaluate
;;; (add-hook 'org-babel-after-execute-hook 'org-display-inline-images
;;; 'append)
#+end_src

#+RESULTS:
: !tb

#+BEGIN_SRC ipython :session mysession :exports none
  # %matplotlib inline
  # %config InlineBackend.figure_format = 'png'
  import matplotlib
  matplotlib.rcParams['font.size'] = 8
  matplotlib.rcParams['legend.fontsize'] = 8
  import matplotlib.pyplot as plt
  import numpy as np

  from collections import defaultdict
  from itertools import cycle

  colors = cycle("rgbyc")
  markers = cycle("+x*^d")
  colorkey = defaultdict(lambda :colors.next())
  markerkey = defaultdict(lambda :markers.next())

  from SimDataDB import *

  # Parameters from the simulation
  domW = 10.0
  domH = 10.0
  # print "Uniaxial compression test: "
  Load = 0.001
  young = 1000.0
  nu = 0.0 #3333333
  loc = 1.0

  x_anal = ( Load * ( 1.0 - nu - 2.0 * nu**2.0 ) \
            / ( young * (nu-1) ) ) * domH*loc
  shear_anal = -( Load * 2.0 / young ) * domH
  problems = { 'Uniaxial':('weight_uni',x_anal,'disp'),
               'Isotropic':('weight_iso',x_anal,'dispx'),
               'Shear':('weight_shear',shear_anal,'disp') }
  anals = {
      'weight_uni': x_anal,
      'weight_iso': x_anal,
      'weight_shear': shear_anal,
      'compress_biaxial': 1.0e-5/3.0
      }
  anal_cols = {
      'weight_uni': 'disp',
      'weight_iso': 'dispx',
      'weight_shear': 'disp',
      'compress_biaxial':'dispy'
      }
  # Load the DB
  sdb = SimDataDB("../coupled/uniaxial.db")
  conn = sdb.Get_Connection()
  c = conn.cursor()

  # Want all of them to be sorted the same way
  weights = [ "const", "inv", "linear", "quadr", "cubic" ]
  RFs = [ 1.5, 2.0, 2.5, 3.0, 3.5 ]
#+END_SRC

#+RESULTS:

* Methods :codeblocks:
#+BEGIN_SRC ipython :session mysession :exports both
  def Query(string):
        c.execute(string)
        res = c.fetchall()
        res.sort()
        return [ list(k) for k in res ] 
  #[ [ k[i] for k in res ] for i in xrange(len(res[0])) ]
  def Make_Plot(string,label, anal=x_anal):
        res = sdb.Query(string)
        plt.plot(  [ domW/k[0] for k in res ],
                   [ ((anal-k[1])/anal) for k in res], label=label,
                   marker=markerkey[label], color=colorkey[label])
  def Make_Log_Plot(string,label, anal=x_anal, ax=None):
        c.execute(string)
        res = c.fetchall()
        res.sort()
        if ax==None: ax=plt.gca()
        ax.loglog( [ domW/k[0] for k in res ],
                    [ np.abs((anal-k[1])/anal) for k in res], label=label,
                    marker=markerkey[label], color=colorkey[label] )
        ax.set_ylim(1.0e-4,1.0e1)
  def plot_radii(method, PLOT=Make_Log_Plot,table='weight_uni'):
      c.execute("SELECT DISTINCT RF FROM {1} WHERE method='{0}'".format(method,table))
      RFs = [x[0] for x in c.fetchall()]
      for w in weights:
          plt.figure()
          for RF in RFs:
              PLOT("SELECT NP,disp FROM weight_uni WHERE nu=0.0 AND RF={0} AND method='{1}' AND weight='{2}'"\
                        .format(RF,method,w), "{0},{1}".format(w,RF))
          #plt.hlines( x_anal, plt.xlim()[0],plt.xlim()[1])
          plt.xlabel('Normalized Particle Radius')
          plt.ylabel('displacement error (mm)')
          plt.legend(loc=2)
          
  def plot_radii_2(method, ptype='Cart', fname = '/tmp/img.png',
                   db='weight_uni',nu='0.0'):
      anal = anals[db]
      if ptype=='Log':
            PLOT = Make_Log_Plot
      else:
            PLOT = Make_Plot
      plt.close('all')
      from matplotlib import gridspec
      c.execute("SELECT DISTINCT RF FROM {1} WHERE method='{0}'".format(method,db))
      RFs = [x[0] for x in c.fetchall()]
      ax = []
      fig = plt.figure(figsize=(8.5, 11))
      cols = 2
      gs = gridspec.GridSpec(len(weights) // cols + 1, cols)
      for i,w in enumerate(weights):
          row = (i // cols)
          col = i % cols
          ax.append(fig.add_subplot(gs[row, col]))
          for R in RFs:
              PLOT("SELECT NP,{5} FROM {3} WHERE nu={4} AND RF={1} AND method='{2}' AND weight='{0}'".format(w,R,method ,db,nu, anal_cols[db])
                   ,str(R),anal=anal)
          ax[-1].set_xlabel(('Logarithm of ' if ptype=='Log' else '') + 'Particle Radius (mm)')
          ax[-1].set_ylabel(('Logarithm of ' if ptype=='Log' else '') + 'displacement error (mm)')
          if ptype != 'Log':
                ax[-1].set_ylim((-0.1,0.1))
          ax[-1].set_title('Convergence for weight={0}'.format(w))
          ax[-1].legend(loc=2)
      fig.tight_layout()
      plt.savefig(fname)
      return '[[{0}]]'.format(fname)

  def plot_radii_3(method, ptype='Log', fname = '/tmp/img.png',
                   db='weight_uni', nu=0.0):
        from matplotlib import gridspec
        anal = anals[db]
        if ptype=='Log':
              PLOT = Make_Log_Plot
        else:
              PLOT = Make_Plot
              plt.close('all')
        fig,axarr = plt.subplots( len(weights), len(problems),
                                 figsize=(6,8), sharex='col', sharey='row')
        # gs = gridspec.GridSpec(len(weights), len(problems))
        for i,w in enumerate(weights):
              for j,(pname,(db,anal,col)) in enumerate(problems.iteritems()):
                    # ax = fig.add_subplot(gs[i,j])
                    ax = axarr[i,j]
                    for R in RFs:
                          PLOT("SELECT NP,{col} FROM {db} \
                               WHERE nu={nu} AND RF={R} AND method='{method}' AND weight='{w}'".format(**locals()),
                               str(R), anal=anal, ax=ax)
                    if j==0:
                          ax.set_ylabel('w='+w)
                    if i==0:
                          ax.set_title(pname)

        fig.subplots_adjust(hspace=0.1,wspace=0.1)
        
        handles, labels = ax.get_legend_handles_labels()
        lgd = axarr[4,1].legend(handles, labels, loc='upper center', bbox_to_anchor=(0.5,-0.3),ncol=5)
        ly = fig.text(0.02,0.5,('Logarithm of ' if ptype=='Log' else '') + 'displacement error (mm)',
                 rotation='vertical', verticalalignment='center',horizontalalignment='center')
        #lx = axarr[4,1].text(0.5,-0.1,('Logarithm of ' if ptype=='Log' else '') + 'Particle Radius (mm)',
        #         rotation='horizontal', verticalalignment='center',horizontalalignment='center')
        axarr[4,1].set_xlabel(('Logarithm of ' if ptype=='Log' else '') + 'Particle Radius (mm)')
        # plt.legend(bbox_to_anchor=(-2.3, -0.302, 3.4, .02),
                   # ncol=5, mode="expand")
        # plt.tight_layout()
        plt.savefig(fname,bbox_extra_artists=(lgd,ly), bbox_inches='tight')
        return '[[{0}]]'.format(fname)

                    
  import scipy.stats
  def order(method,RF,weight,db='weight_uni'):
        res = zip(*Query("SELECT NP,{0} FROM {db} WHERE nu=0.0 AND RF={RF} AND method='{method}' AND NP>99 AND weight='{weight}'".format(anal_cols[db],method=method,RF=RF,weight=weight,db=db)))
        
        anal = anals[db]
        hs = [ domW/float(x) for x in res[0] ]
        es = [ np.abs( ( anal - y) /anal ) for y in res[1] ]
        return scipy.stats.linregress([np.log(h) for h in hs],
                                      [np.log(e) for e in es])[0]
#+END_SRC

#+RESULTS:
in
